Tutorials-2.4.0/hemisph-2-cav1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Sc            Sc [ 0 0 0 0 0 0 0 ] 0.9;

phase1
{
    transportModel      Newtonian;
    nu                  nu [0 2 -1 0 0 0 0] 9e-07;
    rho                 rho [1 -3 0 0 0 0 0] 1001;

    rho0                rho0 [1 -3 0 0 0 0 0] 1001;
    beta                beta [1 -3 0 -1 0 0 0] 0; //-0.616;
    Tref                Tref [0 0 0 1 0 0 0] 293.15;
    psi                 psi  [0 -2 2 0 0 0 0] 4.5e-7;
    lambda              lambda [1 1 -3 -1 0 0 0] 0.6e+1;
    Cp                  Cp [0 2 -2 -1 0 0 0] 4183;
    Prt                 Prt [0 0 0 0 0 0 0] 1.0;
    
    kPsi		kPsi [0 0 0 0 0 0 0] -1;
    R			R    [0 2 -2 -1 0 0 0] 461.88;
}

phase2
{
    transportModel      Newtonian;
    nu                  nu [0 2 -1 0 0 0 0] 1e-05;
    rho                 rho [1 -3 0 0 0 0 0] 1;
    
    rho0                rho0 [1 -3 0 0 0 0 0] 1;
    beta                beta [1 -3 0 -1 0 0 0] 0;//-0.6e-2;
    Tref                Tref [0 0 0 1 0 0 0] 293.15;
    psi                 psi  [0 -2 2 0 0 0 0] 4.0e-6;
    lambda              lambda [1 1 -3 -1 0 0 0] 0.025e+1;
    Cp                  Cp [0 2 -2 -1 0 0 0] 2000;
    Prt                 Prt [0 0 0 0 0 0 0] 1.0;
    
    kPsi		kPsi [0 0 0 0 0 0 0] -1;
    R			R [0 2 -2 -1 0 0 0] 461.88;
}

phaseChangeTwoPhaseMixture	Kunz;
phaseChangeOn			phaseChangeOn [0 0 0 0 0 0 0] 1.0;
tau				tau [0 0 1 0 0 0 0] 0;
pMin				pMin [1 -1 -2 0 0 0 0] 100;

SchnerrSauerCoeffs
{
    n               n      [0 -3 0 0 0 0 0]     1.6e+8;
    dNuc            dNuc   [0 1 0 0 0 0 0]      2.0e-06;
    Cc              Cc     [0 0 0 0 0 0 0]      1;
    Cv              Cv     [0 0 0 0 0 0 0]      1;
}

KunzCoeffs
{
    UInf            UInf   [0 1 -1 0 0 0 0]     5.35;
    tInf            tInf   [0 0 1 0 0 0 0]      0.071; // L = 0.38 m
    Cc              Cc     [0 0 0 0 0 0 0]      1000;
    Cv              Cv     [0 0 0 0 0 0 0]      1000;
}


// ************************************************************************* //
