Tutorials-2.4.0/hemisph-2-cav1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	type            uniformFixedValue;
	uniformValue    tableFile;
	uniformValueCoeffs
	{
	    fileName    "$FOAM_CASE/inletU";
	}
	value           uniform (0 0 0);
    }

    outlet
    {
        type  		zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value		uniform (0 0 0);
    }

        #include "constrain.include";
}

// ************************************************************************* //
