Tutorials-2.4.0/hemisph-2-cav1/0/constrain.include
    slip
    {
        type            slip;
    }
    
    defaultFaces
    {
        type            slip;
    }
    
    axis
    {
        type            slip;
    }

